import 'game.dart';

const gameList = [
  Games(
    title: 'R.E.P.O',
    description: 
      'Ищите ценные объекты, полностью основанные на физике, и обращайтесь с ними бережно, извлекая их, чтобы удовлетворить желания вашего создателя.',
    genre: 'Хоррор, Сетевой кооператив',
    year: 2025,
    rating: 9.0,
    imagePath: 'assets/img/repo.png'
  ),
  Games(
    title: 'Dont Starve Together', 
    description: 'Сражайтесь, занимайтесь фермерством, стройте и исследуйте мир вместе в автономном многопользовательском дополнении к бескомпромиссной игре на выживание в дикой природе.', 
    genre: 'Выживание, Инди', 
    year: 2016, 
    rating: 9.1, 
    imagePath: 'assets/img/dontst.jpg'
  ),
  Games(
    title: 'Stardew Valley', 
    description: 'Вам досталась старая дедушкина ферма в долине Стардью. С горстью монет в кармане и старыми инструментами в руках вы начинаете новую жизнь. Сможете ли вы превратить пустырь в цветущий сад?', 
    genre: 'Симулятор фермы, Пиксельная графика', 
    year: 2016, 
    rating: 10.0, 
    imagePath: 'assets/img/stard.jpg'
  ),
  Games(
    title: 'Phasmophobia', 
    description: 'Паранормальная активность растет, и вы и ваша команда должны использовать все имеющееся в вашем распоряжении оборудование для охоты на привидений, чтобы собрать как можно больше доказательств.', 
    genre: 'Хоррор, Сетевой кооператив', 
    year: 2020, 
    rating: 9.5, 
    imagePath: 'assets/img/phasm.jpg'
  ),
  Games(
    title: 'Cult of the Lamb',
    description: 'Взращивайте собственный культ в землях лжепророков, совершайте походы по таинственным уголкам леса, объединяйте вокруг себя верных последователей и несите своё слово в массы, чтобы сделать свой культ единственным.',
    genre: 'Cтроительство базы, Экшен-рогалик',
    year: 2022,
    rating: 8.7, 
    imagePath: 'assets/img/cult.png',
  ),
  Games(
    title: 'Guilty as Sock',
    description: 'В зале суда суматоха — носки возомнили себя адвокатами, прокурорами и судьями! Приводите нелепые доводы, выдумывайте безумные аргументы и выносите приговоры в этой угарной онлайн-игре, которая заставит вас импровизировать, выстраивать стратегии и вопить «Протестую!» что есть мочи!',
    genre: 'Беседы, Смешная',
    year: 2025,
    rating: 8.9,
    imagePath: 'assets/img/g.jpg',

  ),
  Games(
    title: 'PEAK',
    description: 'PEAK — это совместная игра о восхождении, где малейшая ошибка может привести к гибели. Играйте в одиночку или вместе с группой отчаянных бойскаутов. Сбегите с таинственного острова, для чего вам потребуется забраться на гору в его центре. Хватит ли вам сил, чтобы достичь ПИКА?',
    genre: 'Сетевой кооператив, Приключения',
    year: 2025,
    rating: 8.7,
    imagePath: 'assets/img/peak.png',
  ),
];